# IDataConversionMonitor Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDataConversionMonitor Interface
Members See Also
---
A base class for an application-specific logger. It should be used to track errors during conversion and/or , track conversion progress, cancel a conversion process if necessary. Implementing a logger class is optional, but highly recommended for all but most basic data converters. The base class is UI- and language-independent. It is up to the using app to implement UI. Language-specifc data may be used to communicate information to application users. English should be used to communicate data of interest to Revit development.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public interface IDataConversionMonitor
```

Visual Basic
---
```text
Public Interface IDataConversionMonitor
```

Visual C++
---
```text
public interface class IDataConversionMonitor
```

# See Also
IDataConversionMonitor Members
Autodesk.Revit.DB Namespace